import React from "react";
import "./index.scss";

export const Header = () => {
  return (
    <header className="header">
      <ul className="header__btns">
        <li className="btns__nav">
          <button className="btn" data-testid="btn-nav">
            <svg
              width="25"
              height="25"
              viewBox="0 0 25 25"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              data-testid="svg-nav"
            >
              <g opacity="0.8" clipPath="url(#clip0)">
                <path
                  d="M22.6994 3.13804H2.30063C1.03208 3.13804 0 4.17007 0 5.44023C0 6.70879 1.03208 7.74087 2.30063 7.74087H22.6994C23.9679 7.74087 25 6.70879 25 5.44023C25 4.17007 23.9679 3.13804 22.6994 3.13804Z"
                  fill="#222232"
                />
                <path
                  d="M22.6994 10.1986H2.30063C1.03208 10.1986 0 11.2306 0 12.5008C0 13.7693 1.03208 14.8014 2.30063 14.8014H22.6994C23.9679 14.8014 25 13.7693 25 12.5008C25 11.2306 23.9679 10.1986 22.6994 10.1986Z"
                  fill="#222232"
                />
                <path
                  d="M22.6994 17.2591H2.30063C1.03208 17.2591 0 18.2912 0 19.5613C0 20.8299 1.03208 21.862 2.30063 21.862H22.6994C23.9679 21.862 25 20.8299 25 19.5613C25 18.2912 23.9679 17.2591 22.6994 17.2591Z"
                  fill="#222232"
                />
              </g>
              <defs>
                <clipPath id="clip0">
                  <rect width="25" height="25" fill="white" />
                </clipPath>
              </defs>
            </svg>
          </button>
        </li>
        <li className="btns__sub">
          <button className="btn" data-testid="btn-sub">
            <svg
              width="25"
              height="25"
              viewBox="0 0 25 25"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
              data-testid="svg-sub"
            >
              <g opacity="0.8">
                <path
                  d="M24.2509 15.2396L21.953 13.4427C21.9822 13.1656 22.0072 12.8417 22.0072 12.499C22.0072 12.1562 21.9832 11.8323 21.953 11.5552L24.253 9.75732C24.6801 9.41982 24.7968 8.82085 24.5249 8.32192L22.1353 4.1875C21.8801 3.72085 21.3207 3.48125 20.753 3.69062L18.0415 4.77915C17.5218 4.40415 16.9769 4.0875 16.4134 3.83437L16.0009 0.95835C15.9332 0.4125 15.4582 0 14.8968 0H10.1051C9.54364 0 9.06971 0.4125 9.00301 0.95L8.58949 3.83647C8.04364 4.08232 7.50721 4.39482 6.96449 4.78125L4.24574 3.6896C3.73632 3.49272 3.12694 3.71353 2.87382 4.17812L0.481139 8.31772C0.198864 8.79482 0.315514 9.4146 0.751989 9.76045L3.04989 11.5573C3.01341 11.9083 2.99574 12.2136 2.99574 12.5C2.99574 12.7865 3.01346 13.0917 3.04989 13.4438L0.749889 15.2417C0.32279 15.5802 0.207165 16.1792 0.47904 16.6771L2.86864 20.8115C3.12386 21.2771 3.67801 21.5187 4.25091 21.3083L6.96239 20.2198C7.48114 20.5938 8.02591 20.9104 8.58949 21.1646L9.00199 24.0396C9.06966 24.5875 9.54364 25 10.1061 25H14.8978C15.4593 25 15.9343 24.5875 16.0009 24.05L16.4144 21.1646C16.9603 20.9177 17.4957 20.6062 18.0394 20.2188L20.7582 21.3104C20.8894 21.3614 21.0259 21.3875 21.1665 21.3875C21.5707 21.3875 21.9426 21.1667 22.1301 20.8229L24.5301 16.6667C24.7968 16.1792 24.6801 15.5802 24.2509 15.2396ZM12.5009 16.6667C10.203 16.6667 8.33426 14.7979 8.33426 12.5C8.33426 10.2021 10.203 8.33335 12.5009 8.33335C14.7988 8.33335 16.6676 10.2021 16.6676 12.5C16.6676 14.7979 14.7988 16.6667 12.5009 16.6667Z"
                  fill="#222232"
                />
              </g>
            </svg>
          </button>
        </li>
      </ul>

      <div className="header__menu">
        <ul className="menu__list">
          <li className="list__item">
            <a href="/" className="list__item-link">
              Конвертер валюты
            </a>
          </li>
          <li className="list__item">
            <a href="/currency" className="list__item-link">
              Курсы валют
            </a>
          </li>
        </ul>
      </div>

      <div className="header__sub">
        <ul className="menu__list">
          <li className="list__item">
            <p className="list__item-block">
              <label className="text" htmlFor="select-currency">
                Валюта по умолчанию:
                <select data-testid="selector" id="select-currency">
                  <option value="Российский рубль">Российский рубль</option>
                </select>
              </label>
            </p>
          </li>
        </ul>
      </div>
    </header>
  );
};
